# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'mongodb/brew'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # better cat
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'grep'
brew 'jq'
brew 'yq'

# TODO: configure mackup
# brew 'mackup'

brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Development
brew 'golang'
brew 'nvm'
brew 'nginx'
brew 'yarn'
brew 'protobuf'
cask 'google-cloud-sdk'

# DBs
brew 'mongodb-community'
brew 'redis'

# Kubernetes
brew 'helm'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'k9s'
brew 'stern'
brew 'k3d'

# Apps
cask 'ngrok'
cask '1password'
cask 'discord'
cask 'docker'
cask 'google-chrome'
cask 'insomnia'
# cask 'raycast'
cask 'screenflow'
cask 'flameshot'
cask 'slack'
cask 'the-unarchiver'
cask 'transmit'
cask 'visual-studio-code'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
mas 'Speedtest', id: 1153157709
mas 'Tailscale', id: 1475387142
mas 'Meeter', id: 1510445899