# Tapshomebrew/bundle
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'mongodb/brew'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # better cat
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'grep'
brew 'jq'
brew 'yq'
brew 'tree'

brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Utils
brew 'the_silver_searcher'

# Development
brew 'golang'
brew 'nvm'
brew 'nginx'
brew 'yarn'
brew 'protobuf'
cask 'google-cloud-sdk'

# DBs
brew 'mongodb-community'
brew 'redis'

# Kubernetes
brew 'helm'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'k9s'
brew 'stern'
brew 'k3d'

# Apps

# cask 'google-chrome'
# cask 'docker'
# cask 'slack'
# cask 'zoom'

cask 'meetingbar'
cask 'ngrok'
cask '1password'
cask 'discord'
cask 'raycast'
cask 'screenflow'
cask 'flameshot'
cask 'the-unarchiver'
cask 'transmit'
cask 'vscodium'
cask 'tailscale'
cask 'flycut'

# Quicklook extentions
cask 'qlmarkdown'
cask 'quicklook-json'

# Mac App Store
mas 'Tailscale', id: 1475387142
mas 'Flycut', id: 442160987
